from model.items.armor import Armor


HELMETS = [
    Armor(1, "Деревянный шлем", 1),
    Armor(2, "Железный шлем", 3),
    Armor(3, "Позолоченный шлем", 7)
]

CHEST_PLATES = [
    Armor(1, "Деревянный нагрудник", 2),
    Armor(2, "Железный нагрудник", 4),
    Armor(3, "Позолоченный нагрудник", 7),
    Armor(4, "Нагрудник с рубином", 12),
    Armor(5, "Нагрудник с изумрудом", 17),
    Armor(6, "Нагрудник с бриллиантом", 20)
]

LEGGINGS = [
    Armor(1, "Деревянные штаны", 1),
    Armor(2, "Железные штаны", 3),
    Armor(3, "Позолоченные штаны", 6),
    Armor(4, "Штаны с изумрудом", 10)
]

SHIELDS = [
    Armor(1, "Деревянный щит", 2),
    Armor(2, "Железный щит", 4),
    Armor(3, "Позолоченный щит", 6),
    Armor(4, "Щит с рубином", 8),
    Armor(5, "Щит с изумрудом", 9),
    Armor(6, "Щит с бриллиантом", 10)
]
